{
	"name": "Apatosaurus",
	"read_by_default": true,
	"icon": "paleopedia:textures/apatosaurus_icon.png",
	"category": "lepidodendron:jurassic_animal",
	"turnin": "lepidodendron:pf_adv_book_apatosaurus",
	"pages": [
		{
			"trigger": "lepidodendron:pf_adv_book_apatosaurus",
			"title": "Apatosaurus",
			"type": "quest",
			"text": "$(l)Temporal Range:$() Jurassic$(br2)>Dinosauria $(br)>Saurischia $(br)>Sauropoda $(br)>Diplodocidae $(br)>Apatosaurinae"
		},
        	{
            "type": "entity",
            "name": "A. louisae",
            "entity": "lepidodendron:prehistoric_flora_apatosaurus",
            "rotate": false,
            "default_rotation": 0
       	},
		{
			"advancement": "lepidodendron:pf_adv_book_apatosaurus",
			"type": "text",
			"text": "Apatosaurus is a famous sauropod from the Late Jurassic Morrison Formation. A. ajax was named by Othniel Charles Marsh in 1877 and A. louisae was named by William Holland in 1916. Although many may feel more familiar with A. ajax, A. louisae is known from more complete remains. Apatosaurus gives name to the subfamily of Apatosaurinae which was only considered a valid grouping since 2015. Apatosaurus is well known for the controversy involving the disputed genus of Brontosaurus."
		},
		{
			"advancement": "lepidodendron:pf_adv_book_apatosaurus",
			"type": "text",
			"text": "Brontosaurus excelsus, also described by Marsh in 1879, was argued by Elmer Riggs in 1903 to be not different enough from Apatosaurus to be considered its own genus. Brontosaurus was then considered a junior synonym of Apatosaurus until 2015 when it was reassessed as its own genus based on 13 characteristics. Despite the superficial mainstream appeal at the so-called \"revival\" of Brontosaurus, this study still remains contested within Paleontology. "
		},
		{
			"advancement": "lepidodendron:pf_adv_book_apatosaurus",
			"type": "text",
			"text": "Interest with Apatosaurinae reached another high with the 2015 paper by Michael Taylor, Mathew Wedel, Darren Naish, and Brian Engh in which the unusual triangular cervical vertebrae of Apatosaurinae was hypothesized to have been used in combat, striking down or to the side of opponents. The ventrolateral processes were interpreted as supporting keratinous bosses or neck spikes. The term of this, \"Brontosmash\" was coined by Mark Witton in October of the same year. "
		},
		{
			"type": "lepidodendron:diet",
			"mob": "lepidodendron:prehistoric_flora_apatosaurus"
		},
		{
			"type": "lepidodendron:biomelocations1",
			"mob": "lepidodendron:prehistoric_flora_apatosaurus"
		},
		{
			"type": "lepidodendron:biomelocations2",
			"mob": "lepidodendron:prehistoric_flora_apatosaurus"
		},
		{
			"type": "lepidodendron:biomelocations3",
			"mob": "lepidodendron:prehistoric_flora_apatosaurus"
		},
		{
			"type": "lepidodendron:biomelocations4",
			"mob": "lepidodendron:prehistoric_flora_apatosaurus"
		}
	]
}
