{
	"name": "Aspidorhynchus",
	"read_by_default": true,
	"icon": "paleopedia:textures/items/aspidorhynchus_icon.png",
	"category": "lepidodendron:jurassic_animal",
	"turnin": "lepidodendron:pf_adv_book_aspidorhynchus",
	"pages": [
		{
			"trigger": "lepidodendron:pf_adv_book_aspidorhynchus",
			"title": "Aspidorhynchus",
			"type": "quest",
			"text": "$(l)Temporal Range:$() Jurassic-Cretaceous$(br2)$(l)Habitat:$() Marine$(br2)>Actinopterygii$(br)>Aspidorhynchiformes$(br)>Aspidorhynchidae"
		},
		{
			"type": "image",
			"images": ["paleopedia:textures/aspidorhynchus.png"],
			"title": "A. acutirostris",
			"text": ""
		},
		{
			"advancement": "lepidodendron:pf_adv_book_aspidorhynchus",
			"type": "text",
			"text": "Aspidorhynchus is a genus of Actinopterygian fish that lived between the Late Jurassic and the Early Cretaceous in Europe and potentially Asia, America and the Antarctic. the most obvious characteristic of Aspidorhynchus was the elongated rostrum, which would grow to be visibly longer than the jaw, giving the head the characteristic spear nosed"
		},
		{
			"advancement": "lepidodendron:pf_adv_book_aspidorhynchus",
			"type": "text",
			"text": "look it is most known for, structure most probably used to confer the animal better hydrodynamics while swimming, in a similar fashion to modern day swordfishes. The body of Aspidorhynchus was long and streamlined with dorsal and anal fins moved back towards the tail, a characteristic that allowed the animal to gain additional thrust, making it a very fast predator in its waters."
		},
		{
			"advancement": "lepidodendron:pf_adv_book_aspidorhynchus",
			"type": "text",
			"text": "Aspidorhynchus is the eponymous genus of the Aspidorhynchiformes, an order of fish close to the first Teleosts. Aspidorhynchus holds the status of being among the first fossil fishes to have ever been illustrated, with it's first artistic representation being dated all the way back to 1775, a whole 58 years prior to its official description by Louis Agassiz in 1833 in his work \"Recherches sur les poissons fossiles\"."
		},
		{
			"advancement": "lepidodendron:pf_adv_book_aspidorhynchus",
			"type": "text",
			"text": "The first species to be officially described came from the Solnhofen deposits in Germany, previously described by Blainville in 1818 as under the genus Esox, the same genus modern day pikes are in. After the redescription of the first fossil materials, several other species were instituted based on specimens from Solnhofen and Eichstaett, although probably all part of the same species or misidentified."
		},
		{
			"advancement": "lepidodendron:pf_adv_book_aspidorhynchus",
			"type": "text",
			"text": "Several specimens of Aspidorynchus were found to be instead under the genus Belonostomus, a close relative of it that is also found in the same deposits. Eventually fossils of Aspidorhynchus started being described from other regions as well, like Britain, France and James Ross Island in the Antarctic."
		},
		{
			"advancement": "lepidodendron:pf_adv_book_aspidorhynchus",
			"type": "text",
			"text": "$(l)Eats:$() Fish Food$(br)$(l)Breeds with:$() Fish Food$(br)$(l)Egg Type:$() Drops Egg$(br)$(l)Method of Obtaining:$() Bucket"
		}
	]
}
