{
	"name": "Mussaurus",
	"read_by_default": true,
	"icon": "paleopedia:textures/items/mussaurus_icon.png",
	"category": "lepidodendron:jurassic_animal",
	"turnin": "lepidodendron:pf_adv_book_mussaurus",
	"pages": [
		{
			"trigger": "lepidodendron:pf_adv_book_mussaurus",
			"title": "Mussaurus",
			"type": "quest",
			"text": "$(l)Temporal Range:$() Jurassic$(br2)$(l)Habitat:$() Temperate Forest$(br2)>Dinosauria$(br)>Saurischia$(br)>Sauropodomorpha$(br)>Mussauridae"
		},
		{
			"type": "image",
			"images": ["paleopedia:textures/mussaurus.png"],
			"title": "M. patagonicus",
			"text": ""
		},
		{
			"advancement": "lepidodendron:pf_adv_book_mussaurus",
			"type": "text",
			"text": "Mussaurus is a sauropodomorph from South America. Originally described on baby specimens in 1979, the animal was given the name \"mouse lizard\" based on its diminutive size and large eyes. As more adult specimens were discovered over the years, we now know the animal could grow to 6m in length and weigh more than a 1000Kg. Still to this day several depictions of the animal continue to showcase it as small and quadrupedal, traits seen in its infancy."
		},
		{
			"advancement": "lepidodendron:pf_adv_book_mussaurus",
			"type": "text",
			"text": "Thanks to a paper published in 2022, we now know these primitive Sauropodomorphs reached sexual maturity in their late 20s-early 30s while still appearing immature. They would take another 14 years after they reached sexual maturity to develop into their more recognizable fully adult shape and size."
		},
		{
			"advancement": "lepidodendron:pf_adv_book_mussaurus",
			"type": "text",
			"text": "Not unlike Plateosaurus, the Mussaurus too was bipedal in its later stages of maturity, so much so that some of their remains were interpreted to be Plateosaurus in the early 80s before being properly reassigned to Mussaurus. The original description of the animal was by José Fernando Bonaparte, one of the most well known paleontologists in Argentinean history, who only recently left us in Febuary 2020 at age 91."
		},
		{
			"advancement": "lepidodendron:pf_adv_book_mussaurus",
			"type": "text",
			"text": "$(l)Eats:$() Plants$(br)$(l)Breeds with:$() Plants$(br)$(l)Egg Type:$() Nested Egg$(br)$(l)Method of Obtaining:$() Find Egg in Nest"
		}
	]
}
