{
	"name": "Paradapedium",
	"read_by_default": true,
	"icon": "paleopedia:textures/items/paradapedium_icon.png",
	"category": "lepidodendron:jurassic_animal",
	"turnin": "lepidodendron:pf_adv_book_paradapedium",
	"pages": [
		{
			"trigger": "lepidodendron:pf_adv_book_paradapedium",
			"title": "Paradapedium",
			"type": "quest",
			"text": "$(l)Temporal Range:$() Jurassic$(br2)>Actinopterygii $(br)>Holostei $(br)>Dapediiformes $(br)>Dapediidae"
		},
		{
			"type": "image",
			"images": ["paleopedia:textures/paradapedium.png"],
			"title": "P. egertoni",
			"text": ""
		},
		{
			"advancement": "lepidodendron:pf_adv_book_paradapedium",
			"type": "text",
			"text": "Paradapedium egertoni is a species of Dapediid fish from the Early Jurassic of India. This fish, as large as 32 cm long, is known from the Kota formation of India, found in what were once freshwater sediments, making it a precious species of freshwater Jurassic faunas, notoriously scarce and poorly studied."
		},
		{
			"advancement": "lepidodendron:pf_adv_book_paradapedium",
			"type": "text",
			"text": "The animal had a so called hypsisomid body shape, being characteristically disc shaped and laterally flattened, possessed a rather small head compared to the body and a plating of scales covering it, ensuring the animal was well protected. Larger specimens had more thoroughly ossified roofs of their skulls,"
		},
		{
			"advancement": "lepidodendron:pf_adv_book_paradapedium",
			"type": "text",
			"text": "adorned by numerous and fine tuberculations difficult to see if not from very up close. The rather short jaws terminated in a series of 15-16 teeth, the last of which towards the tip of the snout was quite larger and probably would've looked like a small tusk to an outside observer. Curiously enough, despite the name directly referencing its close cousin Dapedium"
		},
		{
			"advancement": "lepidodendron:pf_adv_book_paradapedium",
			"type": "text",
			"text": "several features of its spine were closer in shape to another Triassic fish, Hemicalypterus, most famous for its half scaled/half naked body. The dorsal fin in Paradapedium originated towards the midpoint of the body and proceeded to run its length up to the base of the tail in a row of around 35 rays, in opposition with the smaller anal fin, which possessed only around 25 rays and ran not even half the length of its dorsal counterpart."
		},
		{
			"advancement": "lepidodendron:pf_adv_book_paradapedium",
			"type": "text",
			"text": "The caudal fin was Hemiheterocercal, meaning it wasn't symmetrical between the upper and lower part but still uniform enough as to not be considered fully heterocercal, like what you see in a shark or sturgeon; in the case of Paradapedium, the caudal fin was bigger on its upper part."
		},
		{
			"type": "lepidodendron:diet",
			"mob": "lepidodendron:prehistoric_flora_paradapedium"
		},
		{
			"type": "lepidodendron:biomelocations1",
			"mob": "lepidodendron:prehistoric_flora_paradapedium"
		},
		{
			"type": "lepidodendron:biomelocations2",
			"mob": "lepidodendron:prehistoric_flora_paradapedium"
		},
		{
			"type": "lepidodendron:biomelocations3",
			"mob": "lepidodendron:prehistoric_flora_paradapedium"
		},
		{
			"type": "lepidodendron:biomelocations4",
			"mob": "lepidodendron:prehistoric_flora_paradapedium"
		}
	]
}
