{
	"name": "Cymbospondylus",
	"read_by_default": true,
	"icon": "paleopedia:textures/cymbospondylus_icon.png",
	"category": "lepidodendron:triassic_animal",
	"turnin": "lepidodendron:pf_adv_book_cymbospondylus",
	"pages": [
		{
			"trigger": "lepidodendron:pf_adv_book_cymbospondylus",
			"title": "Cymbospondylus",
			"type": "quest",
			"text": "$(l)Temporal Range:$() Triassic$(br2)$(l)Habitat:$() Marine$(br2)>Ichthyosauria$(br)>Cymbospondylidae"
		},
		{
			"type": "image",
			"images": ["paleopedia:textures/cymbospondylus.png"],
			"title": "C. petrinus",
			"text": ""
		},
		{
			"advancement": "lepidodendron:pf_adv_book_cymbospondylus",
			"type": "text",
			"text": "Cymbospondylus is a genus of basal Ichthyosaur from the Middle Triassic from Europe and North America. Able to reach massive sizes up to 14 m long if not more, the genus was quite widespread in the Triassic oceans. Due to its size and shape of the tail, it is believed Cymbospondylus was an ambush predator, able to gain sudden bursts of speed to catch up to prey."
		},
		{
			"advancement": "lepidodendron:pf_adv_book_cymbospondylus",
			"type": "text",
			"text": "The stomach contents of a specimen found in Switzerland preserve exclusively remains of cephalopod hooks, which fueled the hypothesis of Cymbospondylus being a cephalopod specialist, an idea that has been criticised by many. A specimen preserving what seem to be three fetuses also lends credit to the idea that even this early on in their evolution, ichthyosaurs could’ve already been live bearers."
		},
		{
			"advancement": "lepidodendron:pf_adv_book_cymbospondylus",
			"type": "text",
			"text": "First described in 1868, many fragmentary remains have been classified under the genus, several of which considered either undiagnostic, invalid or from different genera altogether to this day, not an uncommon occurance with early paleontological finds.\nIn 2021 an almost 2 m long skull was described as a new species under the genus, representing potentially the largest member known with an estimated length of 17 m, the remains were nicknamed Jim 2."
		},
		{
			"advancement": "lepidodendron:pf_adv_book_cymbospondylus",
			"type": "text",
			"text": "$(l)Eats:$() Fish$(br)$(l)Breeds with:$() Fish$(br)$(l)Egg Type:$() Live Birth$(br)$(l)Method of Obtaining:$() Bucket"
		}
	]
}
