{
	"name": "Titanites",
	"read_by_default": true,
	"icon": "lepidodendron:shell_titanites",
	"category": "lepidodendron:jurassic_animal",
	"turnin": "lepidodendron:pf_adv_book_ammonite_titanites",
	"pages": [
		{
			"trigger": "lepidodendron:pf_adv_book_ammonite_titanites",
			"title": "Titanites",
			"type": "quest",
			"text": "$(l)Temporal Range:$() Jurassic$(br2)>Ammonitida"
		},
		{
			"type": "image",
			"images": ["paleopedia:textures/titanites.png"],
			"title": "T. giganteus",
			"text": ""
		},
		{
			"advancement": "lepidodendron:pf_adv_book_ammonite_titanites",
			"type": "text",
			"text": "Titanites is a genus of ammonite from the late Jurassic of Europe. Most famous for its size, which the name references, the shell of Titanites could grow beyond 1 m in diameter, making it one among several examples of gigantism in cephalopods known from both the fossil record and modern day."
		},
		{
			"advancement": "lepidodendron:pf_adv_book_ammonite_titanites",
			"type": "text",
			"text": "Known mostly from sediments from Portland Dorset, the large ammonite once swam in what were once tropical waters filled with coralline algae and oyster reefs  along sandy seafloors. Quarrymen working at Portland usually dig these ammonites out of the Limestone they work with to keep as souvenirs or sell tourists, with specimens of these giant ammonites "
		},
		{
			"advancement": "lepidodendron:pf_adv_book_ammonite_titanites",
			"type": "text",
			"text": "dotting the gardens in the city like stone monoliths to the area's ancient past. Very rarely these ammonites are also found in walls and other building blocks of houses in the area. In the past it was thought that gigantism was mainly influenced by oxygen availability, factor that has been given credit for the size of Carboniferous arthropods in the past; however "
		},
		{
			"advancement": "lepidodendron:pf_adv_book_ammonite_titanites",
			"type": "text",
			"text": "this might not be the case in all contexts. When Titanites lived, the world was going through a greenhouse stage, temperatures were high and Pangea was breaking up, opening what would become Tethys and greatly changing the regime dynamics in the ecosystems of the time."
		},
		{
			"advancement": "lepidodendron:pf_adv_book_ammonite_titanites",
			"type": "text",
			"text": "Although the reason for why Titanites grew so large are still not entirely understood, to swim freely, this large sized predator would've needed at the very least 2 or 3 meters of water depth and thus moderately deep waters."
		},
		{
			"type": "lepidodendron:diet",
			"mob": "lepidodendron:prehistoric_flora_ammonite_titanites"
		},
		{
			"type": "lepidodendron:biomelocations1",
			"mob": "lepidodendron:prehistoric_flora_ammonite_titanites"
		},
		{
			"type": "lepidodendron:biomelocations2",
			"mob": "lepidodendron:prehistoric_flora_ammonite_titanites"
		},
		{
			"type": "lepidodendron:biomelocations3",
			"mob": "lepidodendron:prehistoric_flora_ammonite_titanites"
		},
		{
			"type": "lepidodendron:biomelocations4",
			"mob": "lepidodendron:prehistoric_flora_ammonite_titanites"
		}
	]
}
