{
	"name": "Cervifurca",
	"read_by_default": true,
	"icon": "lepidodendron:cervifurca_raw",
	"category": "lepidodendron:mobs",
	"turnin": "lepidodendron:pf_adv_book_cervifurca",
	"pages": [
		{
			"trigger": "lepidodendron:pf_adv_book_cervifurca",
			"title": "Cervifurca",
			"type": "quest",
			"text": "$(l)Temporal Range:$() Carboniferous$(br2)>Chordata$(br)>Chondrichthyes$(br)>Holocephali$(br)>Iniopterygiformes$(br)>Iniopterygidae"
		},
		{
			"type": "entity",
			"name": "C. nasuta",
			"entity": "lepidodendron:prehistoric_flora_cervifurca",
			"rotate": false,
			"default_rotation": 0
		},
		{
			"advancement": "lepidodendron:pf_adv_book_cervifurca",
			"type": "text",
			"text": "Cervifurca nasuta is a species of iniopterygian from the upper Carboniferous of North America. This poorly documented species of iniopterygian is most recognizable by the unique shape of the body, which was flattened and round, quite unusual among members of it's group. Compared to other iniopterygians, Cervifurca also had unusually small pectoral fins, which seem to indicate a less active swimming style and potentially hinting at this creature potentially being"
		},
		{
			"advancement": "lepidodendron:pf_adv_book_cervifurca",
			"type": "text",
			"text": "demersal, living close and against the seafloor. Not only this animal had a flattened appearance that indicate said lifestyle, but the eyes, positioned dorsolaterally, would've given this animal a more upturned field of view, allowing it to see what swam above it to an extent. In the past this animal was represented with two horn-like protrusions jutting out of the front of the head; this interpretation is now known to be erroneous as the two peduncles acted as"
		},
		{
			"advancement": "lepidodendron:pf_adv_book_cervifurca",
			"type": "text",
			"text": "support for a soft tissue snout, giving this animal less of a forked head look and more of a flattened shark face. Further evidence of this animal's benthic lifestyle is the preservation of the specimens themselves, who were found preserved in dorsal view, in a similar fashion to Batoids and other inhabitants of the benthos known in the fossil record. The animal possessed rather small pelvic fins onto which attached disproportionally long Pterygodia,"
		},
		{   "advancement": "lepidodendron:pf_adv_book_cervifurca",
			"type": "text",
			"test": "which wouldn't have been of much use to swim."
		},
		{
			"advancement": "lepidodendron:pf_adv_book_cervifurca",
			"type": "text",
			"text": "Cervifurca was first discovered in 1997 by Rainer Zangerl and described on specimens found in the Excello Shale in Indiana; the original fossils were recovered by Rainer and his wife during excavations in 1982-83."
		},
		{
			"type": "lepidodendron:diet",
			"mob": "lepidodendron:prehistoric_flora_cervifurca"
		},
		{
			"type": "lepidodendron:biomelocations1",
			"mob": "lepidodendron:prehistoric_flora_cervifurca"
		},
		{
			"type": "lepidodendron:biomelocations2",
			"mob": "lepidodendron:prehistoric_flora_cervifurca"
		},
		{
			"type": "lepidodendron:biomelocations3",
			"mob": "lepidodendron:prehistoric_flora_cervifurca"
		},
		{
			"type": "lepidodendron:biomelocations4",
			"mob": "lepidodendron:prehistoric_flora_cervifurca"
		}
	]
}
