{
	"name": "Dimorphodon",
	"read_by_default": true,
	"icon": "paleopedia:textures/items/dimorphodon_icon.png",
	"category": "lepidodendron:mobs",
	"turnin": "lepidodendron:pf_adv_book_dimorphodon",
	"pages": [
		{
			"trigger": "lepidodendron:pf_adv_book_dimorphodon",
			"title": "Dimorphodon",
			"type": "quest",
			"text": "$(l)Temporal Range:$() Jurassic$(br2)>Chordata$(br)>Pterosauria$(br)>Macronychoptera$(br)>Dimorphodontidae"
		},
        	{
            "type": "entity",
            "name": "D. macronyx",
            "entity": "lepidodendron:prehistoric_flora_dimorphodon",
            "rotate": false,
            "default_rotation": 0
       	},
		{
			"advancement": "lepidodendron:pf_adv_book_dimorphodon",
			"type": "text",
			"text": "Dimorphodon is a genus of macronychopteran pterosaur from the Lower Jurassic of Europe. With a wingspan of around 1.5 m, Dimorphodon had short wings compared to the length of the body - which was around 1 m in length - and was a rather poor flyer; due to its robust skeleton and short wings, the animal probably only flew for brief distances and as a last resort, not unlike modern day fowl."
		},
		{
			"advancement": "lepidodendron:pf_adv_book_dimorphodon",
			"type": "text",
			"text": "Dimorphodon would've been a decent climber- just like many other members of the non - pterodactyloid branch of pterosauria - but is also notable for the well developed legs that would've made him an apt runner. The diet of this animal has long been debated with early hypotheses placing it as a soaring insect hunter and later made into a piscivore; "
		},
		{
			"advancement": "lepidodendron:pf_adv_book_dimorphodon",
			"type": "text",
			"text": " today we know Dimorphodon was a specialized carnivore that mostly fed on ground vertebrates and the occasional invertebrate, as confirmed by examinations of dental microwear. The jaws of Dimorphodon were adapted to grab and hold prey, being able to close rather quickly with little penetrative strength of its teeth."
		},
		{
			"advancement": "lepidodendron:pf_adv_book_dimorphodon",
			"type": "text",
			"text": "The first confirmed specimen of the animal was collected by famous fossil collector and paleontologist Mary Anning in the sediments at Lyme Regis in the year 1828, more than 30 years before the animal's official description under its current genus name. Like with many early discoveries in Paleontology, the animal was first classified inside one of few wastebasket taxa, being named a species of Pterodactylus in 1835."
		},
		{
			"advancement": "lepidodendron:pf_adv_book_dimorphodon",
			"type": "text",
			"text": "The name Dimorphodon was assigned years later in 1859 upon Owen's description of further specimens, this time including the skull, which he regarded distinct enough from Pterodactylus. A second species of Dimorphodon was described in 1998 from remains unearthed in Mexico, however we now believe this second species to not be closely related to Dimorphodon but rather represent an early relative of anurognathids."
		},
		{
			"advancement": "lepidodendron:pf_adv_book_dimorphodon",
			"type": "text",
			"text": "Dimorphodon has a long history in paleoart with a long standing meme sometimes dubbed the \"Puffinodon\", where many artists chose to depict the animal exhibiting puffin coloration and behaviour, trend probably initiated in 1986 with the depiction of a fishing Dimorphodon by Bob Bakker. The idea that pterosaurs were mostly piscivorous is an old notion stemming from early paleontology interpreting them as marine bird analogues;"
		},
		{
			"advancement": "lepidodendron:pf_adv_book_dimorphodon",
			"type": "text",
			"text": "over the years this idea has been repeatedly challenges and we now know pterosaurs had varied diets and lived in many disparate environments. As more information on pterosaur lifestyle and diet is discovered, dated ideas and concepts like the Puffinodon slowly disappear from public consciousness, closing this interesting chapter in the history of our Pterosaur understanding."
		},
		{
			"type": "lepidodendron:diet",
			"mob": "lepidodendron:prehistoric_flora_dimorphodon"
		},
		{
			"type": "lepidodendron:biomelocations1",
			"mob": "lepidodendron:prehistoric_flora_dimorphodon"
		},
		{
			"type": "lepidodendron:biomelocations2",
			"mob": "lepidodendron:prehistoric_flora_dimorphodon"
		},
		{
			"type": "lepidodendron:biomelocations3",
			"mob": "lepidodendron:prehistoric_flora_dimorphodon"
		},
		{
			"type": "lepidodendron:biomelocations4",
			"mob": "lepidodendron:prehistoric_flora_dimorphodon"
		}
	]
}
