{
	"name": "Dragonfly",
	"read_by_default": true,
	"icon": "paleopedia:textures/items/dragonfly_icon.png",
	"category": "lepidodendron:mobs",
	"turnin": "lepidodendron:pf_adv_book_dragonfly",
	"pages": [
		{
			"trigger": "lepidodendron:pf_adv_book_dragonfly",
			"title": "Dragonfly",
			"type": "quest",
			"text": "$(l)Temporal Range:$() Jurassic - Present$(br2)>Arthropoda$(br)>Insecta$(br)>Odonata$(br)>Epiprocta$(br)>Anisoptera"
		},
		{
			"type": "image",
			"images": ["paleopedia:textures/dragonfly.png"],
			"title": "Anisoptera",
			"text": ""
		},
		{
			"advancement": "lepidodendron:pf_adv_book_dragonfly",
			"type": "text",
			"text": "Dragonflies are a group of predatory insects belonging to the infraorder Anisoptera within the order Odonata. Despite having well-known relatives as far back as the Carboniferous, true dragonflies are much more modern, only appearing in the Jurassic. The earlier “giant dragonflies” of the Palaeozoic are in reality equally closely related to both modern dragonflies and damselflies, and are very anatomically distinct from both."
		},
		{
			"advancement": "lepidodendron:pf_adv_book_dragonfly",
			"type": "text",
			"text": "As compared to their ancestors and extinct relatives, dragonflies have greatly reduced antennae, a proportionally larger head, and more complex wing structure, suggesting greater maneuverability in flight. Dragonflies are incredibly well adapted predators, with flight abilities surpassing those of almost any other insect group, and a hunting success rate as high as 95% for any prey that they pursue. "
		},
		{
			"advancement": "lepidodendron:pf_adv_book_dragonfly",
			"type": "text",
			"text": "They are hemimetabolous, meaning there is a distinct nymphal stage and adult stage with no pupal stage between. As nymphs, dragonflies are fully aquatic, and adults are typically found in environments nearby water. Dragonfly nymphs, like the adults, are predatory and possess a modified labium capable of rapidly unfolding to grasp prey that is often as large as they are. "
		},
		{
			"advancement": "lepidodendron:pf_adv_book_dragonfly",
			"type": "text",
			"text": " Historically, dragonflies and other odonates have been grouped with the mayflies of the order Ephemeroptera and the extinct Palaeodictyopteroids in the group Palaeoptera on account of their shared lack of folding wings. This group has become increasingly viewed as a wastebasket taxon in recent years, and it is plausible that any of these three subgroups may in reality be closer related to neopterous insects than to each other."
		},
		{
			"type": "lepidodendron:diet",
			"mob": "lepidodendron:prehistoric_flora_dragonfly"
		},
		{
			"type": "lepidodendron:biomelocations1",
			"mob": "lepidodendron:prehistoric_flora_dragonfly"
		},
		{
			"type": "lepidodendron:biomelocations2",
			"mob": "lepidodendron:prehistoric_flora_dragonfly"
		},
		{
			"type": "lepidodendron:biomelocations3",
			"mob": "lepidodendron:prehistoric_flora_dragonfly"
		},
		{
			"type": "lepidodendron:biomelocations4",
			"mob": "lepidodendron:prehistoric_flora_dragonfly"
		}
	]
}
