{
	"name": "Lasanius",
	"read_by_default": true,
	"icon": "paleopedia:textures/items/lasanius_icon.png",
	"category": "lepidodendron:mobs",
	"turnin": "lepidodendron:pf_adv_book_lasanius",
	"pages": [
		{
			"trigger": "lepidodendron:pf_adv_book_lasanius",
			"title": "Lasanius",
			"type": "quest",
			"text": "$(l)Temporal Range:$() Silurian$(br2)>Chordata$(br)>Anaspida$(br)>Birkeniiformes$(br)>Lasaniidae"
		},
		{
			"type": "entity",
			"name": "L. problematicus",
			"entity": "lepidodendron:prehistoric_flora_lasanius",
			"rotate": false,
			"default_rotation": 0
		},
		{
			"advancement": "lepidodendron:pf_adv_book_lasanius",
			"type": "text",
			"text": "Lasanius is a genus of anaspid fish from the Upper Silurian of Scotland. While usually only around 5 cm long, incomplete specimens from the same genus seem to indicate it could grow up to as much as 15 cm in length. The body was long and thin, the skin wasn't covered in scales unlike its cousins like Birkenia, with the only exception being the row of median hook shaped spikes on its back. Due to the cartilaginous nature of its skeleton,"
		},
		{
			"advancement": "lepidodendron:pf_adv_book_lasanius",
			"type": "text",
			"text": "the only hard parts of Lasanius' body to be consistently preserved are the 17 - 24 aforementioned hook-shaped spikes, the series of six ossicles associated to the branchial openings and the associated post-cephalic \"sticks\"; all other remains of Lasanius are carbon films. The number of the ossicles and the \"sticks\" varies between species and even individuals, in some cases not even being the same on both sides of the same animal;"
		},
		{
			"advancement": "lepidodendron:pf_adv_book_lasanius",
			"type": "text",
			"text": "although several hypotheses were formulated on the function of those L shaped structures, ranging from support for the gills to muscle support, no real answer has been reached yet on their function. Due to the preservation of this animal, not much is known about the head, aside from two lens-like structures, interpreted to be eyes. Lasanius was first described in 1899 by Traquair on several Scottish fossils."
		},
		{
			"advancement": "lepidodendron:pf_adv_book_lasanius",
			"type": "text",
			"text": "In 1958 Lasanius was reconstructed as an active swimmer using its hypocercal tail to swim vertically head down so that it could use its mouth to suck up food directly from the muddy seafloor."
		},
		{
			"type": "lepidodendron:diet",
			"mob": "lepidodendron:prehistoric_flora_lasanius"
		},
		{
			"type": "lepidodendron:biomelocations1",
			"mob": "lepidodendron:prehistoric_flora_lasanius"
		},
		{
			"type": "lepidodendron:biomelocations2",
			"mob": "lepidodendron:prehistoric_flora_lasanius"
		},
		{
			"type": "lepidodendron:biomelocations3",
			"mob": "lepidodendron:prehistoric_flora_lasanius"
		},
		{
			"type": "lepidodendron:biomelocations4",
			"mob": "lepidodendron:prehistoric_flora_lasanius"
		}
	]
}
