{
	"name": "Nothosaurus",
	"read_by_default": true,
	"icon": "paleopedia:textures/items/nothosaurus_icon.png",
	"category": "lepidodendron:mobs",
	"turnin": "lepidodendron:pf_adv_book_nothosaurus",
	"pages": [
		{
			"trigger": "lepidodendron:pf_adv_book_nothosaurus",
			"title": "Nothosaurus",
			"type": "quest",
			"text": "$(l)Temporal Range:$() Triassic$(br2)>Sauropterygia$(br)>Nothosauroidea$(br)>Nothosauridae"
		},
		{
			"type": "image",
			"images": ["paleopedia:textures/nothosaurus.png"],
			"title": "N. mirabilis",
			"text": ""
		},
		{
			"advancement": "lepidodendron:pf_adv_book_nothosaurus",
			"type": "text",
			"text": "Nothosaurus is a widespread genus of Sauropterygian reptile from the Triassic of North America, Europe and China. Perhaps the most known among its peers, this large marine predator had short but powerful limbs ending in webbed toes and a strong tail, clear adaptations to an aquatic lifestyle."
		},
		{
			"advancement": "lepidodendron:pf_adv_book_nothosaurus",
			"type": "text",
			"text": "Between 1-4 m long, with a few specimens potentially larger from Germany and Italy, the Nothosaurus could resemble another group of marine reptiles to the inexperienced eye such as the plesiosaurs, to which they were not related to. The animal is often compared ecologically to a seal, as both are aquatic predators that feed on fish; However, the comparisons between the two end there."
		},
		{
			"advancement": "lepidodendron:pf_adv_book_nothosaurus",
			"type": "text",
			"text": "The long neck and skull, ending with an array of needle-like teeth, made Nothosaurus extremely effective at holding onto prey once caught and, while not incredibly agile in open waters, it probably was able to use its paddle-like limbs to disturb the sediment on the seafloor to drive prey out in the open. Most notably known to have been able to move both on land and water, "
		},
		{
			"advancement": "lepidodendron:pf_adv_book_nothosaurus",
			"type": "text",
			"text": "this myth about the animal is potentially untrue, as the small limbs and large body would've probably made it quite sluggish on the ground, meaning it was quite unlikely for the animal to have been able to freely go back and forth between land and sea, much less being able to walk or trot on land. More than a dozen species of Nothosaurus are known from around the globe, "
		},
		{
			"advancement": "lepidodendron:pf_adv_book_nothosaurus",
			"type": "text",
			"text": "the first being named in 1834 from Germany and the most recent being described in 2014 from China. The same year as the latest described species was named, a study was conducted on all known Nothosaurus and relatives to test their relations and discovered the genus was probably polyphyletic, meaning some of the animals we call Nothosaurus today might change name in the future as we revisit the fossils of these animals."
		},
		{
			"type": "lepidodendron:diet",
			"mob": "lepidodendron:prehistoric_flora_nothosaurus"
		},
		{
			"type": "lepidodendron:biomelocations1",
			"mob": "lepidodendron:prehistoric_flora_nothosaurus"
		},
		{
			"type": "lepidodendron:biomelocations2",
			"mob": "lepidodendron:prehistoric_flora_nothosaurus"
		},
		{
			"type": "lepidodendron:biomelocations3",
			"mob": "lepidodendron:prehistoric_flora_nothosaurus"
		},
		{
			"type": "lepidodendron:biomelocations4",
			"mob": "lepidodendron:prehistoric_flora_nothosaurus"
		}
	]
}
