{
	"name": "Plateosaurus",
	"read_by_default": true,
	"icon": "paleopedia:textures/items/plateosaurus_icon.png",
	"category": "lepidodendron:mobs",
	"turnin": "lepidodendron:pf_adv_book_plateosaurus",
	"pages": [
		{
			"trigger": "lepidodendron:pf_adv_book_plateosaurus",
			"title": "Plateosaurus",
			"type": "quest",
			"text": "$(l)Temporal Range:$() Triassic$(br2)>Dinosauria$(br)>Saurischia$(br)>Sauropodomorpha$(br)>Plateosauridae"
		},
		{
			"type": "entity",
			"name": "P. trossingensis",
			"entity": "lepidodendron:prehistoric_flora_plateosaurus",
			"rotate": false,
			"default_rotation": 0
		},
		{
			"advancement": "lepidodendron:pf_adv_book_plateosaurus",
			"type": "text",
			"text": "Plateosaurus is a genus of Plateosaurid Sauropodomorph from the Late Triassic of Europe and Greenland. Although in the recent past known from remains assigned to many species, today Plateosaurus is only recognised from three, many others since being reassigned to other genera inside the group, like the South American Plateosaurus finds being reassigned to Mussaurus."
		},
		{
			"advancement": "lepidodendron:pf_adv_book_plateosaurus",
			"type": "text",
			"text": "Plateosaurus was a large bipedal herbivore that measured in its adult stage between 4-10 m in length. The animal, like other members of its group, had a long neck ending in a small head and a long tail; the arms of Plateosaurus were short but ended in powerful hands adapted for grasping while the legs, with the lower part of them proportionally larger than the top, were consistent with an animal able to run surprisingly fast for its body size."
		},
		{
			"advancement": "lepidodendron:pf_adv_book_plateosaurus",
			"type": "text",
			"text": "The head was long and rectangular, hosting a series of leaf shaped teeth specifically adapted for a herbivorous diet, with a jaw capable of delivering very strong biteforces. The animal was discovered for the first time in 1834 by Johann Friedrich Engelhard and named by Christian Erich Hermann von Meyer, from which the scientific name of the once type species P. engelhardti came from, now considered to be undiagnostic."
		},
		{
			"advancement": "lepidodendron:pf_adv_book_plateosaurus",
			"type": "text",
			"text": "The animal was among the very first dinosaurs to be named, although at the time of its description the word \"dinosaur\" didn't yet exist, as it was coined only in 1842 by Sir Richard Owen, who excluded Plateosaurus remains from his description and definition of the group, as the known material was too fragmentary to be ascribed to a dinosaur at the time."
		},
		{
			"advancement": "lepidodendron:pf_adv_book_plateosaurus",
			"type": "text",
			"text": "Due to this confusing history, Plateosaurus has been known under many names in the past, a wide range of Junior synonyms now for the most part invalid. With more than 100 skeletons known today, several of which almost complete, Plateosauru is one of the better known dinosaurs to science and boasts the title of the third oldest valid dinosaur to be named."
		},
		{
			"type": "lepidodendron:diet",
			"mob": "lepidodendron:prehistoric_flora_plateosaurus"
		},
		{
			"type": "lepidodendron:biomelocations1",
			"mob": "lepidodendron:prehistoric_flora_plateosaurus"
		},
		{
			"type": "lepidodendron:biomelocations2",
			"mob": "lepidodendron:prehistoric_flora_plateosaurus"
		},
		{
			"type": "lepidodendron:biomelocations3",
			"mob": "lepidodendron:prehistoric_flora_plateosaurus"
		},
		{
			"type": "lepidodendron:biomelocations4",
			"mob": "lepidodendron:prehistoric_flora_plateosaurus"
		}
	]
}
